Revit 2026 API

# ExporterIFCGetMaterialIdForCurrentExportState Method

---

This gets the material id that is associated with the element in the current export state.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GetMaterialIdForCurrentExportState()
```
```vb
Public Function GetMaterialIdForCurrentExportState As ElementId
```
```cpp
public:
ElementId^ GetMaterialIdForCurrentExportState()
```
```fsharp
member GetMaterialIdForCurrentExportState : unit -> ElementId
```

#### Return Value

ElementId The material id.

Even though there could be several materials associated with the element (set during PushExportState()), unless the element has support for IfcMaterialLayerSet, IFC output will include only this one.

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace